Repository: Mark-Shternberg/PowerDNS-WEB
Catalog: Resources/Pages/index.*.resx
Languages: ru

# Title
source: PowerDNS Statistics
ru: Статистика PowerDNS

# OverviewTitle
source: PowerDNS Overview
ru: Обзор PowerDNS

# OverviewSubtitle
source: Live metrics & recursor stats
ru: Онлайн-метрики и статистика рекурсора

# Metric.ActivePort
source: Active Port
ru: Активный порт

# Metric.Uptime
source: Uptime
ru: Время работы

# Metric.TotalQueries
source: Total Queries
ru: Всего запросов

# Metric.QpsApprox
source: QPS (approx)
ru: QPS (прибл.)

# Section.Statistics
source: Statistics
ru: Статистика

# Card.MissingTypes
source: Queries for Missing Types
ru: Запросы к отсутствующим типам

# Card.Nonexistent
source: Queries for Nonexistent Records
ru: Запросы к несуществующим записям

# Card.UdpReceived
source: UDP Queries Received
ru: Получено UDP-запросов

# Recursor.Title
source: Recursor
ru: Рекурсор

source: Recursor Port
ru: Порт рекурсора

source: Recursor Uptime
ru: Время работы рекурсора

# Recursor.CacheHits
source: Cache Hits
ru: Попадания в кэш

# Recursor.CacheMissesRatio
source: Cache Misses · Hit Ratio
ru: Промахи кэша · Доля попаданий

# Recursor.TopRequests
source: Top Requests
ru: Топ запросов

# Recursor.TopRemotes
source: Top Remotes
ru: Топ удалённых клиентов

# Chart.QpsLast5m
source: Query rate (QPS), last 5 minutes
ru: Скорость запросов (QPS), последние 5 минут

# Common.Loading
source: Loading...
ru: Загрузка…

# Common.NoData
source: No data available
ru: Нет данных

# Time.H
source: h
ru: ч

# Time.M
source: m
ru: м
