Repository: Mark-Shternberg/PowerDNS-WEB
Catalog: Resources/Pages/login.*.resx
Languages: ru

# Area
source: Secure Area
ru: Защищённая область

source: Enter Login
ru: Введите логин

source: Enter password
ru: Введите пароль

source: Login
ru: Логин

source: Password
ru: Пароль

# Login_ShowPassword
source: Show password
ru: Показать пароль

# Login_SignIn
source: Sign in
ru: Войти

# Welcome
source: Welcome back — please enter your credentials.
ru: Добро пожаловать — введите ваши учётные данные

# Login_HidePassword
source: Hide password
ru: Скрыть пароль

# Login_NetworkError
source: Network unavailable. Try later.
ru: Сеть недоступна. Попробуйте позже.

# Login_AuthErrorPrefix
source: Sign-in error.
ru: Ошибка авторизации.

# Login_TryAgain
source: Try again.
ru: Попробуйте ещё раз.

# Login_SigningIn
source: Signing in...
ru: Входим...

# Login_SuccessRedirect
source: Signed in! Redirecting...
ru: Авторизация успешна! Перенаправление...

# Login_Required
source: Username and password are required.
ru: Логин и пароль обязательны.

# Login_AuthSource
source: Authorization source
ru: Источник авторизации

# Login_AuthSource_DB
source: Internal Database
ru: Внутренняя База данных

# Login_PwHint
source: Enter password
ru: Введите пароль

# Login_InvalidCredentials
source: You entered incorrect credentials
ru: Вы ввели неправильный логин или пароль

# Login_FirstRunNotice
source: First sign-in detected. No users exist yet — an Administrator account will be created with the username, display name, and password you enter.
ru: Первый вход. В базе ещё нет пользователей — будет создан администратор с указанными вами логином, отображаемым именем и паролем.

# Login_DisplayName
source: Display name
ru: Отображаемое имя

source: Enter display name
ru: Введите отображаемое имя

# Login_DisplayNameRequired
source: Please enter a display name.
ru: Укажите отображаемое имя.

# Error_DisplayNameRequiredFirstRun
source: Display name is required on first sign-in.
ru: Для первого входа необходимо указать отображаемое имя.
