Repository: Mark-Shternberg/PowerDNS-WEB
Catalog: Resources/Pages/recursor.*.resx
Languages: ru

# Err.Internal
source: Internal server error.
ru: Внутренняя ошибка сервера.

# Err.ZoneRequired
source: Zone name is required.
ru: Необходимо указать имя зоны.

# Err.NoServersProvided
source: At least one DNS server must be specified.
ru: Нужно указать хотя бы один DNS-сервер.

# Err.InvalidServerFormat
source: Invalid server format: {0}
ru: Неверный формат сервера: {0}

# Err.RecursorApi
source: Recursor API error: {0}
ru: Ошибка Recursor API: {0}

# Err.CannotDeleteRoot
source: The root zone (.) cannot be removed.
ru: Корневую зону (.) удалять нельзя.

# Err.RecursorDisabled
source: Recursor is disabled in settings.
ru: Recursor отключён в настройках.

# Ans.Forward.Added
source: Forward zone added.
ru: Зона пересылки добавлена.

# Ans.Forward.Updated
source: Forwarders updated.
ru: Список форвардеров обновлён.

# Ans.Forward.Removed
source: Forward zone removed.
ru: Зона пересылки удалена.

# Recursor_Title
source: Recursor Forward Zones
ru: Рекурсор: перенаправление зон

# Recursor_Subtitle
source: Configure per-zone forwarding (upstream resolvers)
ru: Настройка переадресации по зонам (вышестоящие резолверы)

# Recursor_Disabled_WithLink
source: Recursor is disabled in {0} page.
ru: Рекурсор отключен на странице {0}.

# Link_Settings
source: settings
ru: настройки

# Label_AvailableZones
source: Available Zones
ru: Доступные зоны

# Option_NoZones
source: No zones available to recurse
ru: Нет зон для передачи на рекурсор

# Btn_Add
source: Add
ru: Добавить

# Heading_ConfiguredForwardZones
source: Configured Forward Zones
ru: Настроенные перенаправляемые зоны

# Th_Zone
source: Zone
ru: Зона

# Th_ForwardTo
source: Forward To
ru: Перенаправлять на

# Th_Actions
source: Actions
ru: Действия

# Btn_Edit
source: Edit
ru: Изменить

# Btn_Remove
source: Remove
ru: Удалить

# Btn_Delete
source: Delete
ru: Удалить

# Btn_Cancel
source: Cancel
ru: Отмена

# Btn_Close
source: Close
ru: Закрыть

# Btn_SaveChanges
source: Save Changes
ru: Сохранить изменения

# Btn_AddDnsServer
source: Add DNS Server
ru: Добавить DNS-сервер

# Authoritative_Server_Label
source: Authoritative server
ru: Авторитативный сервер

# Modal_Edit_TitlePrefix
source: Edit
ru: Изменить

# Modal_Edit_TitleSuffixZone
source: zone
ru: зону

# Label_UpstreamDNS
source: Upstream DNS servers
ru: Вышестоящие DNS-серверы

# Placeholder_IpPort
source: IP:Port (e.g., 8.8.8.8:53)
ru: IP:Порт (например, 8.8.8.8:53)

# Toast_SelectZone
source: Please select a zone.
ru: Выберите зону.

# Toast_Added
source: Zone added successfully
ru: Зона успешно добавлена.

# Toast_AddFail
source: Failed to add forward zone.
ru: Не удалось добавить зону.

# Toast_Removed
source: Zone removed successfully
ru: Зона успешно удалена.

# Toast_RemoveFail
source: Failed to remove forward zone
ru: Не удалось удалить зону.

# Toast_SaveOk
source: DNS servers updated successfully
ru: DNS-серверы обновлены.

# Toast_SaveFail
source: Failed to save DNS servers
ru: Не удалось сохранить DNS-серверы.

# Toast_NoDns
source: At least one DNS server must be specified.
ru: Укажите хотя бы один DNS-сервер.

# Toast_DnsIdx
source: Error in DNS {n}: {err}
ru: Ошибка в DNS {n}: {err}

# Confirm_DeleteMsg
source: Are you sure you want to remove the forward zone: {name}?
ru: Удалить перенаправление зоны: {name}?
