Repository: Mark-Shternberg/PowerDNS-WEB
Catalog: Resources/Pages/settings.*.resx
Languages: ru

# Settings_Title
source: Settings
ru: Настройки

# Section_MySQL
source: MySQL Settings
ru: Параметры MySQL

# Section_PowerDNS
source: PowerDNS Settings
ru: Параметры PowerDNS

# Section_Recursor
source: Recursor Settings
ru: Параметры Recursor

# Label_Server
source: Server
ru: Сервер

# Label_User
source: User
ru: Пользователь

# Label_Password
source: Password
ru: Пароль

# Label_Database
source: Database
ru: База данных

# Label_ApiKey
source: API Key
ru: API-ключ

# Label_DefaultA
source: Default A Record
ru: IPv4 по умолчанию (A)

# Heading_SOA
source: SOA Configuration
ru: Конфигурация SOA

# Label_SoaNs
source: Primary NS
ru: Основной NS

# Label_SoaMail
source: Admin Email
ru: Почта администратора

# Label_RecursorStatus
source: Recursor Status
ru: Статус Recursor

# Label_RecursorUrl
source: Recursor URL
ru: URL Recursor

# Option_Enabled
source: Enabled
ru: Включён

# Option_Disabled
source: Disabled
ru: Отключён

# Btn_SaveSettings
source: Save Settings
ru: Сохранить настройки

# Title_ShowHide
source: Show/Hide
ru: Показать/скрыть

# Tip_RecursorAuthoritativeHint
source: Tip: you can point some zones to authoritative via
ru: Подсказка: на странице Recursor можно направить некоторые зоны на авторитативный сервер через

# Placeholder_MySQLServer
source: 127.0.0.1 or host
ru: 127.0.0.1 или имя хоста

# Placeholder_DefaultA
source: A record IPv4 (e.g., 203.0.113.10)
ru: IPv4 для A-записи (напр., 203.0.113.10)

# Validation_MySQL_Required
source: MySQL: server, user and database are required.
ru: MySQL: необходимо указать сервер, пользователя и базу данных.

# Validation_PowerDNS_Url
source: PowerDNS: API URL must be http(s)://…
ru: PowerDNS: API URL должен быть в формате http(s)://…

# Validation_DefaultA_Invalid
source: Default A Record: invalid IPv4.
ru: IPv4 по умолчанию: некорректный адрес.

# Validation_SoaNs_Invalid
source: SOA Primary NS: invalid host name.
ru: Основной NS: некорректное имя хоста.

# Validation_SoaEmail_Invalid
source: SOA Admin Email: invalid email.
ru: Почта администратора SOA: некорректный e-mail.

# Validation_Recursor_Url
source: Recursor: URL must be http(s)://…
ru: Recursor: URL должен быть в формате http(s)://…

# Save_Success
source: Settings saved.
ru: Настройки сохранены.

source: Save failed.
ru: Не удалось сохранить настройки.

# Msg_SettingsSaved
source: Settings saved.
ru: Настройки сохранены.

# Err_Save
source: Save settings error.
ru: Ошибка сохранения настроек.

# Err_SaveDetailed
source: Save settings error: {0}
ru: Ошибка сохранения настроек: {0}

# Err_ConfigNotFound
source: Configuration file not found.
ru: Файл конфигурации не найден.

# Err_MySQL_Required
source: MySQL: server, user and database are required.
ru: MySQL: необходимо указать сервер, пользователя и базу данных.

# Err_PowerDNS_Required
source: PowerDNS: API URL and API Key are required.
ru: PowerDNS: необходимо указать API URL и API-ключ.

# Err_Recursor_Required
source: Recursor: URL and API Key are required when Recursor is Enabled.
ru: Recursor: URL и API-ключ обязательны, если Recursor включён.

# Err_MySqlConnection
source: MySQL connection error: {0}
ru: Ошибка подключения к MySQL: {0}
