Repository: Mark-Shternberg/PowerDNS-WEB
Catalog: Resources/Pages/zones.*.resx
Languages: ru

# Title
source: Zones
ru: Зоны

# Header.Title
source: Zones
ru: Зоны

# Header.Subtitle
source: Authoritative zones management
ru: Управление авторитативными зонами

# Btn.AddForward
source: Add forward zone
ru: Добавить прямую зону

# Btn.AddReverse
source: Add reverse zone
ru: Добавить обратную зону

# Btn.Edit
source: Edit
ru: Изменить

# Btn.Delete
source: Delete
ru: Удалить

# Btn.Close
source: Close
ru: Закрыть

# Btn.Add
source: Add
ru: Добавить

# Btn.Save
source: Save
ru: Сохранить

# Btn.Cancel
source: Cancel
ru: Отмена

# Btn.Keys
source: Keys
ru: Ключи

# Search.Placeholder
source: Search by domain
ru: Поиск по домену

# Search.Clear
source: Clear
ru: Очистить

# Th.Domain
source: Domain
ru: Домен

# Th.Master
source: Master
ru: Мастер

# Th.Type
source: Type
ru: Тип

# Th.Serial
source: Serial
ru: Серийный

# Th.Actions
source: Actions
ru: Действия

# Dnssec.Enabled
source: Enabled
ru: Включён

# Dnssec.Disabled
source: Disabled
ru: Отключён

# Modal.AddGenericTitle
source: Add zone
ru: Добавить зону

# Modal.AddForwardTitle
source: Add forward zone
ru: Добавить прямую зону

# Modal.AddReverseTitle
source: Add reverse zone
ru: Добавить обратную зону

# Modal.EditTitle
source: Edit zone
ru: Редактировать зону

# Field.ZoneName
source: Zone name
ru: Имя зоны

# Field.ZoneName.Invalid
source: Please enter a valid zone name.
ru: Введите корректное имя зоны.

# Field.RevPrefix
source: Reverse prefix
ru: Префикс обратной зоны

# Field.RevPrefix.HelpHtml
source: Network prefix (no last octet), e.g. <code>192.168.0.</code>
ru: Префикс сети (без последнего октета), напр. <code>192.168.0.</code>

# Field.RevPrefix.Invalid
source: Please enter reverse prefix like 192.168.0.
ru: Введите префикс вида 192.168.0.

# Field.ZoneType
source: Zone type
ru: Тип зоны

# Field.ZoneType.Invalid
source: Please select zone type.
ru: Выберите тип зоны.

# Field.Dnssec.Invalid
source: Please choose DNSSEC state.
ru: Выберите состояние DNSSEC.

# Field.MasterServer
source: Master server
ru: Мастер-сервер

# Field.MasterServer.Invalid
source: Master server IP is required for Slave zone.
ru: Для Slave-зоны нужен IP мастер-сервера.

# Confirm.Title
source: Confirm deletion
ru: Подтвердите удаление

# Confirm.TextPrefix
source: Are you sure you want to delete zone:
ru: Удалить зону:

# Keys.Title
source: DNSSEC Keys
ru: DNSSEC-ключи

# Keys.Warning
source: Provide the DS records below to your domain registrar.
ru: Передайте DS-записи ниже вашему регистратору доменов.

# Common.Loading
source: Loading…
ru: Загрузка…

# Msg.ZoneAdded
source: Zone added.
ru: Зона добавлена.

# Msg.ZoneUpdated
source: Zone updated.
ru: Зона обновлена.

# Msg.ZoneDeleted
source: Zone deleted.
ru: Зона удалена.

# Msg.ZoneAddedRecursorWarn
source: Zone added. Error adding forward zone in recursor: {0}
ru: Зона добавлена. Ошибка при добавлении форвард-зоны в recursor: {0}

# Msg.ZoneDeletedRecursorWarn
source: Zone deleted. Error removing forward zone in recursor: {0}
ru: Зона удалена. Ошибка при удалении форвард-зоны в recursor: {0}

# Msg.ZoneDeletedRecursorWarn2
source: Zone deleted. Warning: error removing forward zone in recursor.
ru: Зона удалена. Предупреждение: ошибка удаления форвард-зоны в recursor.

# Err.PdnsUrlMissing
source: PowerDNS URL is not configured.
ru: Не задан URL PowerDNS.

# Err.ZoneNameEmpty
source: Zone name is empty.
ru: Имя зоны пустое.

# Err.InvalidReversePrefix
source: Invalid reverse prefix.
ru: Неверный префикс обратной зоны.

# Err.InvalidParams
source: Invalid request parameters.
ru: Некорректные параметры запроса.

# Err.PowerDnsApi
source: PowerDNS API error: {0}
ru: Ошибка PowerDNS API: {0}

# Err.CreateDnssecKeys
source: Failed to create DNSSEC keys: {0}
ru: Не удалось создать DNSSEC-ключи: {0}

# Err.AddSoa
source: Failed to add SOA record: {0}
ru: Не удалось добавить запись SOA: {0}

# Err.FetchZone
source: Failed to fetch zone '{0}': {1}
ru: Не удалось получить данные зоны «{0}»: {1}

# Err.ParseZoneData
source: Failed to parse current zone data.
ru: Не удалось распарсить данные зоны.

# Err.CreateDnssecKeyGeneric
source: Failed to create DNSSEC key: {0}
ru: Не удалось создать DNSSEC-ключ: {0}

# Err.ConnPdns
source: Connection error to PowerDNS API.
ru: Ошибка подключения к PowerDNS API.

# Err.InternalAdd
source: Internal server error while adding zone.
ru: Внутренняя ошибка при добавлении зоны.

# Err.InternalEdit
source: Internal server error while updating zone.
ru: Внутренняя ошибка при обновлении зоны.

# Err.InternalDelete
source: Internal server error while deleting zone.
ru: Внутренняя ошибка при удалении зоны.

# Err.InternalGeneric
source: Internal server error: {0}
ru: Внутренняя ошибка: {0}
